results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg102400-tps1000-batch16384-acksall-prod12-complz4-trial1/producer-perf-5.log
producer_index=5
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 4385.0 ms avg latency, 4385.0 ms max latency.
42 records sent, 7.8 records/sec (0.76 MB/sec), 7062.5 ms avg latency, 16407.0 ms max latency.
102 records sent, 19.0 records/sec (1.86 MB/sec), 9206.8 ms avg latency, 11199.0 ms max latency.
144 records sent, 27.4 records/sec (2.67 MB/sec), 11306.0 ms avg latency, 12744.0 ms max latency.
208 records sent, 41.5 records/sec (4.05 MB/sec), 11946.2 ms avg latency, 14063.0 ms max latency.
282 records sent, 56.3 records/sec (5.50 MB/sec), 7058.7 ms avg latency, 9364.0 ms max latency.
312 records sent, 62.2 records/sec (6.08 MB/sec), 4032.6 ms avg latency, 5543.0 ms max latency.
335 records sent, 66.0 records/sec (6.45 MB/sec), 1262.0 ms avg latency, 3105.0 ms max latency.
297 records sent, 59.2 records/sec (5.78 MB/sec), 147.7 ms avg latency, 493.0 ms max latency.
289 records sent, 57.3 records/sec (5.60 MB/sec), 66.9 ms avg latency, 196.0 ms max latency.
272 records sent, 54.1 records/sec (5.29 MB/sec), 73.8 ms avg latency, 255.0 ms max latency.
311 records sent, 61.1 records/sec (5.96 MB/sec), 57.0 ms avg latency, 205.0 ms max latency.
310 records sent, 61.7 records/sec (6.03 MB/sec), 64.8 ms avg latency, 184.0 ms max latency.
313 records sent, 61.3 records/sec (5.99 MB/sec), 74.6 ms avg latency, 337.0 ms max latency.
324 records sent, 64.5 records/sec (6.30 MB/sec), 64.3 ms avg latency, 246.0 ms max latency.
340 records sent, 67.9 records/sec (6.63 MB/sec), 58.4 ms avg latency, 255.0 ms max latency.
344 records sent, 68.6 records/sec (6.70 MB/sec), 46.0 ms avg latency, 172.0 ms max latency.
356 records sent, 71.1 records/sec (6.95 MB/sec), 55.2 ms avg latency, 174.0 ms max latency.
345 records sent, 68.6 records/sec (6.70 MB/sec), 50.5 ms avg latency, 227.0 ms max latency.
336 records sent, 66.8 records/sec (6.53 MB/sec), 53.2 ms avg latency, 281.0 ms max latency.
356 records sent, 71.2 records/sec (6.95 MB/sec), 529.4 ms avg latency, 1290.0 ms max latency.
345 records sent, 68.9 records/sec (6.73 MB/sec), 41.2 ms avg latency, 136.0 ms max latency.
341 records sent, 68.0 records/sec (6.64 MB/sec), 52.5 ms avg latency, 291.0 ms max latency.
337 records sent, 67.1 records/sec (6.55 MB/sec), 53.6 ms avg latency, 284.0 ms max latency.
332 records sent, 66.1 records/sec (6.46 MB/sec), 51.5 ms avg latency, 196.0 ms max latency.
320 records sent, 61.9 records/sec (6.04 MB/sec), 41.9 ms avg latency, 183.0 ms max latency.
360 records sent, 71.9 records/sec (7.02 MB/sec), 69.3 ms avg latency, 262.0 ms max latency.
343 records sent, 68.4 records/sec (6.68 MB/sec), 50.9 ms avg latency, 214.0 ms max latency.
8333 records sent, 52.430899 records/sec (5.12 MB/sec), 1153.10 ms avg latency, 16407.00 ms max latency, 59 ms 50th, 9096 ms 95th, 12653 ms 99th, 13699 ms 99.9th.